Immrcorn/ESP32S3_Baby_Monitor/app_httpd.cpp
static esp_err_t pll_handler(httpd_req_t *req) {
  char *buf = NULL;

  if (parse_get(req, &buf) != ESP_OK) {
    return ESP_FAIL;
  }

  int bypass = parse_get_var(buf, "bypass", 0);
  int mul = parse_get_var(buf, "mul", 0);
  int sys = parse_get_var(buf, "sys", 0);
  int root = parse_get_var(buf, "root", 0);
  int pre = parse_get_var(buf, "pre", 0);
  int seld5 = parse_get_var(buf, "seld5", 0);
  int pclken = parse_get_var(buf, "pclken", 0);
  int pclk = parse_get_var(buf, "pclk", 0);
  free(buf);

  log_i("Set Pll: bypass: %d, mul: %d, sys: %d, root: %d, pre: %d, seld5: %d, "
        "pclken: %d, pclk: %d",
        bypass, mul, sys, root, pre, seld5, pclken, pclk);
  sensor_t *s = esp_camera_sensor_get();
  int res = s->set_pll(s, bypass, mul, sys, root, pre, seld5, pclken, pclk);
  if (res) {
    return httpd_resp_send_500(req);
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

static esp_err_t win_handler(httpd_req_t *req) {
  char *buf = NULL;

  if (parse_get(req, &buf) != ESP_OK) {
    return ESP_FAIL;
  }

  int startX = parse_get_var(buf, "sx", 0);
  int startY = parse_get_var(buf, "sy", 0);
  int endX = parse_get_var(buf, "ex", 0);
  int endY = parse_get_var(buf, "ey", 0);
  int offsetX = parse_get_var(buf, "offx", 0);
  int offsetY = parse_get_var(buf, "offy", 0);
  int totalX = parse_get_var(buf, "tx", 0);
  int totalY = parse_get_var(buf, "ty", 0);
  int outputX = parse_get_var(buf, "ox", 0);
  int outputY = parse_get_var(buf, "oy", 0);
  bool scale = parse_get_var(buf, "scale", 0) == 1;
  bool binning = parse_get_var(buf, "binning", 0) == 1;
  free(buf);

  log_i("Set Window: Start: %d %d, End: %d %d, Offset: %d %d, Total: %d %d, "
        "Output: %d %d, Scale: %u, Binning: %u",
        startX, startY, endX, endY, offsetX, offsetY, totalX, totalY, outputX,
        outputY, scale, binning);
  sensor_t *s = esp_camera_sensor_get();
  int res = s->set_res_raw(s, startX, startY, endX, endY, offsetX, offsetY,
                           totalX, totalY, outputX, outputY, scale, binning);
  if (res) {
    return httpd_resp_send_500(req);
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}
void audioLevelTask(void *param) {
  const float alpha = 0.25f;
  uint32_t lastDebugMs = 0;
  uint32_t zeroReadStreak = 0;

  while (true) {
    size_t bytesRead = I2S.readBytes((char *)audioChunkBuffer,
                                     CHUNK_SAMPLES * sizeof(int16_t));
    if (bytesRead > 0) {
      int sampleCount = bytesRead / sizeof(int16_t);
      int64_t sum = 0;
      for (int i = 0; i < sampleCount; i++) {
        int32_t sample = audioChunkBuffer[i];
        sum += (int64_t)sample * sample;
      }
      float rms = sqrtf((float)sum / (float)sampleCount);
      float normalized = (rms / 32768.0f) * 100.0f;
      if (!isfinite(normalized)) {
        normalized = 0.0f;
      }
      if (!isfinite(currentLevel)) {
        currentLevel = 0.0f;
      }

      currentLevel = alpha * normalized + (1.0f - alpha) * currentLevel;
      if (!isfinite(currentLevel)) {
        currentLevel = 0.0f;
      }

      zeroReadStreak = 0;

      if (!audioBurstActive && currentLevel > threshold) {
        audioBurstActive = true;
        burstEndTime = millis() + BURST_MS;
        log_i("[AUDIO] Burst started - level=%.1f", currentLevel);
      }
    } else {
      zeroReadStreak++;
    }

    if (audioBurstActive && millis() > burstEndTime) {
      audioBurstActive = false;
      log_i("[AUDIO] Burst ended");
    }

    uint32_t now = millis();
    if (now - lastDebugMs >= 5000) {
      lastDebugMs = now;
      float lvl = isfinite(currentLevel) ? currentLevel : 0.0f;
      Serial.printf("[AUDIO] level=%.1f lastBytes=%u zeroStreak=%u\n", lvl,
                    (unsigned)bytesRead, (unsigned)zeroReadStreak);
    }

    vTaskDelay(pdMS_TO_TICKS(5));
  }
}

static esp_err_t level_handler(httpd_req_t *req) {
  float level = currentLevel;
  if (!isfinite(level)) {
    currentLevel = 0.0f;
    level = 0.0f;
  }

  char json[96];
  snprintf(json, sizeof(json),
           "{\"level\":%.1f,\"threshold\":%d,\"burst\":%d,\"audio_ok\":%d}",
           level, threshold, audioBurstActive ? 1 : 0, audioOk ? 1 : 0);

  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, json, strlen(json));
}

static esp_err_t set_threshold_handler(httpd_req_t *req) {
  char *buf = NULL;
  if (parse_get(req, &buf) != ESP_OK) {
    return ESP_FAIL;
  }

  char valStr[8];
  if (httpd_query_key_value(buf, "value", valStr, sizeof(valStr)) != ESP_OK) {
    free(buf);
    return httpd_resp_send_404(req);
  }
  free(buf);

  int newVal = atoi(valStr);
  if (newVal >= 5 && newVal <= 95) {
    threshold = newVal;
    prefs.putInt("threshold", threshold);
    log_i("[AUDIO] Threshold set %d", threshold);
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, "OK", 2);
}

// Audio burst streamer
static esp_err_t audio_handler(httpd_req_t *req) {
  httpd_resp_set_type(req, "audio/x-raw");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

  if (!audioBurstActive) {
    return httpd_resp_send(req, NULL, 0); // nothing playng
  }

  // Stream Chunks while burst is active
  while (audioBurstActive && millis() < burstEndTime) {
    size_t bytesRead = I2S.readBytes((char *)audioChunkBuffer,
                                     CHUNK_SAMPLES * sizeof(int16_t));

    if (bytesRead > 0) {
      if (httpd_resp_send_chunk(req, (const char *)audioChunkBuffer,
                                bytesRead) != ESP_OK) {
        break;
      }
    }
    vTaskDelay(pdMS_TO_TICKS(1));
  }
  httpd_resp_send_chunk(req, NULL, 0);
  return ESP_OK;
}

static esp_err_t index_handler(httpd_req_t *req) {
  httpd_resp_set_type(req, "text/html");
  httpd_resp_set_hdr(req, "Content-Encoding", "gzip");
  return httpd_resp_send(req, (const char *)dashboard_html_gz,
                         dashboard_html_gz_len);
}

static esp_err_t legacy_index_handler(httpd_req_t *req) {
  httpd_resp_set_type(req, "text/html");
  httpd_resp_set_hdr(req, "Content-Encoding", "gzip");
  sensor_t *s = esp_camera_sensor_get();
  if (s != NULL) {
    if (s->id.PID == OV3660_PID) {
      return httpd_resp_send(req, (const char *)index_ov3660_html_gz,
                             index_ov3660_html_gz_len);
    } else if (s->id.PID == OV5640_PID) {
      return httpd_resp_send(req, (const char *)index_ov5640_html_gz,
                             index_ov5640_html_gz_len);
    } else {
      return httpd_resp_send(req, (const char *)index_ov2640_html_gz,
                             index_ov2640_html_gz_len);
    }
  } else {
    log_e("Camera sensor not found");
    return httpd_resp_send_500(req);
  }
}

