Immrcorn/ESP32S3_Baby_Monitor/app_httpd.cpp
void startCameraServer() {
  httpd_config_t config = HTTPD_DEFAULT_CONFIG();
  config.max_uri_handlers = 16;

  httpd_uri_t index_uri = {.uri = "/",
                           .method = HTTP_GET,
                           .handler = index_handler,
                           .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
                           ,
                           .is_websocket = true,
                           .handle_ws_control_frames = false,
                           .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t legacy_index_uri = {.uri = "/legacy",
                                  .method = HTTP_GET,
                                  .handler = legacy_index_handler,
                                  .user_ctx = NULL};

  httpd_uri_t status_uri = {.uri = "/status",
                            .method = HTTP_GET,
                            .handler = status_handler,
                            .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
                            ,
                            .is_websocket = true,
                            .handle_ws_control_frames = false,
                            .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t cmd_uri = {.uri = "/control",
                         .method = HTTP_GET,
                         .handler = cmd_handler,
                         .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
                         ,
                         .is_websocket = true,
                         .handle_ws_control_frames = false,
                         .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t capture_uri = {.uri = "/capture",
                             .method = HTTP_GET,
                             .handler = capture_handler,
                             .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
                             ,
                             .is_websocket = true,
                             .handle_ws_control_frames = false,
                             .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t stream_uri = {.uri = "/stream",
                            .method = HTTP_GET,
                            .handler = stream_handler,
                            .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
                            ,
                            .is_websocket = true,
                            .handle_ws_control_frames = false,
                            .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t bmp_uri = {.uri = "/bmp",
                         .method = HTTP_GET,
                         .handler = bmp_handler,
                         .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
                         ,
                         .is_websocket = true,
                         .handle_ws_control_frames = false,
                         .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t xclk_uri = {.uri = "/xclk",
                          .method = HTTP_GET,
                          .handler = xclk_handler,
                          .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
                          ,
                          .is_websocket = true,
                          .handle_ws_control_frames = false,
                          .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t reg_uri = {.uri = "/reg",
                         .method = HTTP_GET,
                         .handler = reg_handler,
                         .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
                         ,
                         .is_websocket = true,
                         .handle_ws_control_frames = false,
                         .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t greg_uri = {.uri = "/greg",
                          .method = HTTP_GET,
                          .handler = greg_handler,
                          .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
                          ,
                          .is_websocket = true,
                          .handle_ws_control_frames = false,
                          .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t pll_uri = {.uri = "/pll",
                         .method = HTTP_GET,
                         .handler = pll_handler,
                         .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
                         ,
                         .is_websocket = true,
                         .handle_ws_control_frames = false,
                         .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t win_uri = {.uri = "/resolution",
                         .method = HTTP_GET,
                         .handler = win_handler,
                         .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
                         ,
                         .is_websocket = true,
                         .handle_ws_control_frames = false,
                         .supported_subprotocol = NULL
#endif
  };

  httpd_uri_t level_uri = {.uri = "/level",
                           .method = HTTP_GET,
                           .handler = level_handler,
                           .user_ctx = NULL};

  httpd_uri_t set_threshold_uri = {.uri = "/set",
                                   .method = HTTP_GET,
                                   .handler = set_threshold_handler,
                                   .user_ctx = NULL};

  httpd_uri_t audio_uri = {.uri = "/audio",
                           .method = HTTP_GET,
                           .handler = audio_handler,
                           .user_ctx = NULL};

  ra_filter_init(&ra_filter, 20);

  // ======================= BABY MONITOR AUDIO INIT =====================
  prefs.begin("babymonitor", false);
  threshold = prefs.getInt("threshold", 45);
  log_i("[AUDIO] Loaded threshold = %d", threshold);
  Serial.printf("[AUDIO] Loaded threshold = %d\n", threshold);

  I2S.setPinsPdmRx(42, 41);
  if (!I2S.begin(I2S_MODE_PDM_RX, SAMPLE_RATE, I2S_DATA_BIT_WIDTH_16BIT,
                 I2S_SLOT_MODE_MONO)) {
    audioOk = false;
    log_e("[AUDIO] I2S microphone initialization FAILED");
    Serial.println("[AUDIO] I2S microphone initialization FAILED");
  } else {
    audioOk = true;
    log_i("[AUDIO] I2S microphone ready on GPIOs 42/41");
    Serial.println("[AUDIO] I2S microphone ready on GPIOs 42/41");
    xTaskCreatePinnedToCore(audioLevelTask, "audioLevelTask", 4096, NULL, 5,
                            NULL, 1);
  }
// ========================================================================
#if CONFIG_ESP_FACE_RECOGNITION_ENABLED
  recognizer.set_partition(ESP_PARTITION_TYPE_DATA, ESP_PARTITION_SUBTYPE_ANY,
                           "fr");

  // load ids from flash partition
  recognizer.set_ids_from_flash();
#endif
  log_i("Starting web server on port: '%d'", config.server_port);
  if (httpd_start(&camera_httpd, &config) == ESP_OK) {
    httpd_register_uri_handler(camera_httpd, &index_uri);
    httpd_register_uri_handler(camera_httpd, &legacy_index_uri);
    httpd_register_uri_handler(camera_httpd, &cmd_uri);
    httpd_register_uri_handler(camera_httpd, &status_uri);
    httpd_register_uri_handler(camera_httpd, &capture_uri);
    httpd_register_uri_handler(camera_httpd, &bmp_uri);

    httpd_register_uri_handler(camera_httpd, &xclk_uri);
    httpd_register_uri_handler(camera_httpd, &reg_uri);
    httpd_register_uri_handler(camera_httpd, &greg_uri);
    httpd_register_uri_handler(camera_httpd, &pll_uri);
    httpd_register_uri_handler(camera_httpd, &win_uri);
    httpd_register_uri_handler(camera_httpd, &level_uri);
    httpd_register_uri_handler(camera_httpd, &set_threshold_uri);
    httpd_register_uri_handler(camera_httpd, &audio_uri);
  }

  config.server_port += 1;
  config.ctrl_port += 1;
  log_i("Starting stream server on port: '%d'", config.server_port);
  if (httpd_start(&stream_httpd, &config) == ESP_OK) {
    httpd_register_uri_handler(stream_httpd, &stream_uri);
  }
}

void setupLedFlash(int pin) {
#if CONFIG_LED_ILLUMINATOR_ENABLED
  ledcAttach(pin, 5000, 8);
#else
  log_i("LED flash is disabled -> CONFIG_LED_ILLUMINATOR_ENABLED = 0");
#endif
}
